mock-example/src/test/resources/xml/CRM/UpdateDeal/rq1.xml

<?xml version="1.0" encoding="UTF-8"?><soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header xmlns:rs="http://sbrf.ru/NCP/CRM/UpdateDealRs/" xmlns:rsd="http://sbrf.ru/NCP/CRM/UpdateDealRq/Data/" xmlns:rq="http://sbrf.ru/NCP/CRM/UpdateDealRq/" xmlns:crm="http://sbrf.ru/NCP/CRM/"/>
    <soap-env:Body xmlns:rs="http://sbrf.ru/NCP/CRM/UpdateDealRs/" xmlns:rsd="http://sbrf.ru/NCP/CRM/UpdateDealRq/Data/" xmlns:rq="http://sbrf.ru/NCP/CRM/UpdateDealRq/" xmlns:crm="http://sbrf.ru/NCP/CRM/">
        <crm:updateDealRq xmlns:upd="http://sbrf.ru/NCP/CRM/UpdateDealRq/">
            <rq:deal>
                <rq:dealID>string1</rq:dealID>
                <rq:contractID>string2</rq:contractID>
                <rq:dealCreationDate>2008-09-29T05:49:03</rq:dealCreationDate>
                <rq:dealEssense>string4</rq:dealEssense>
                <rq:requestPurpose>string5</rq:requestPurpose>
                <rq:salesMethod>string6</rq:salesMethod>
                <rq:dealStatus>string7</rq:dealStatus>
                <rq:requestDate>2014-09-08</rq:requestDate>
                <rq:origOrgUnit>string9</rq:origOrgUnit>
                <rq:origOrgDivision>string10</rq:origOrgDivision>
                <rq:clientFileID>string11</rq:clientFileID>
                <rq:dealFileID>string12</rq:dealFileID>
                <rq:comment>string13</rq:comment>
                <rq:supLMID>string14</rq:supLMID>
                <rq:clientManagerID>string15</rq:clientManagerID>
                <rq:products>
                    <rq:productID>116</rq:productID>
                    <rq:productName>string17</rq:productName>
                    <rq:category>string18</rq:category>
                    <rq:productInfo>
                        <rq:purpose>string19</rq:purpose>
                        <rq:creditMode>string20</rq:creditMode>
                        <rq:currencyOfFunding>str21</rq:currencyOfFunding>
                        <rq:currency>s22</rq:currency>
                        <rq:interestRateType>string23</rq:interestRateType>
                        <rq:selectionSchedule>string24</rq:selectionSchedule>
                        <rq:changesSchedule>string25</rq:changesSchedule>
                        <rq:selectionSchedulePeriod>string26</rq:selectionSchedulePeriod>
                        <rq:changesSchedulePeriod>string27</rq:changesSchedulePeriod>
                        <rq:interestRateOrder>string28</rq:interestRateOrder>
                        <rq:interestPaymentOrder>string29</rq:interestPaymentOrder>
                        <rq:refinancing>true</rq:refinancing>
                        <rq:providing>string30</rq:providing>
                        <rq:suspensiveСondition>string31</rq:suspensiveСondition>
                        <rq:principal>1.051732E7</rq:principal>
                        <rq:principalBaseCurrency>1.051733E7</rq:principalBaseCurrency>
                        <rq:startDate>2018-11-01+04:34</rq:startDate>
                        <rq:interestRate>1.051735E7</rq:interestRate>
                        <rq:creditTerm>136</rq:creditTerm>
                        <rq:period>137</rq:period>
                        <rq:gracePeriod>138</rq:gracePeriod>
                        <rq:repaymentSchedule>string39</rq:repaymentSchedule>
                        <rq:turnover>140</rq:turnover>
                        <rq:covenants>string41</rq:covenants>
                        <rq:minRate>1.051742E7</rq:minRate>
                        <rq:proposedCollateral>string43</rq:proposedCollateral>
                        <rq:debtLimit>string44</rq:debtLimit>
                        <rq:pledgeInsurance>string45</rq:pledgeInsurance>
                        <rq:customerProspects>string46</rq:customerProspects>
                        <rq:financingTerm>string47</rq:financingTerm>
                        <rq:firstCountry>string48</rq:firstCountry>
                        <rq:lastCountry>string49</rq:lastCountry>
                        <rq:fee>
                            <rq:feeName>string50</rq:feeName>
                            <rq:anotherFeeName>string51</rq:anotherFeeName>
                            <rq:calculationBase>string52</rq:calculationBase>
                            <rq:paymentOrder>string53</rq:paymentOrder>
                        </rq:fee>
                        <rq:repaymentScheduleDetails>
                            <rq:sheduleDate>2013-05-22+04:54</rq:sheduleDate>
                            <rq:sheduleAmount>1.051755E7</rq:sheduleAmount>
                        </rq:repaymentScheduleDetails>
                        <rq:selectionScheduleDetails>
                            <rq:sheduleDate>2002-11-05+03:56</rq:sheduleDate>
                            <rq:sheduleAmount>1.051759E7</rq:sheduleAmount>
                        </rq:selectionScheduleDetails>
                        <rq:changesScheduleDetails>
                            <rq:sheduleDate>2002-06-24+04:58</rq:sheduleDate>
                            <rq:sheduleAmount>1.051759E7</rq:sheduleAmount>
                        </rq:changesScheduleDetails>
                    </rq:productInfo>
                    <rq:collateral>
                        <rq:collateralType>string60</rq:collateralType>
                        <rq:ownerID>string61</rq:ownerID>
                        <rq:estimatedValue>1.051762E7</rq:estimatedValue>
                        <rq:discountRate>1.051763E7</rq:discountRate>
                        <rq:estimatedValueCorrected>1.051764E7</rq:estimatedValueCorrected>
                        <rq:qualityCategory>string65</rq:qualityCategory>
                        <rq:daysForCalculation>166</rq:daysForCalculation>
                        <rq:estimatedValueCorrectedToEAD>1.051767E7</rq:estimatedValueCorrectedToEAD>
                        <rq:securityShare>168</rq:securityShare>
                        <rq:EstimatedValueSource>string69</rq:EstimatedValueSource>
                        <rq:estimationDate>2016-02-20+04:00</rq:estimationDate>
                        <rq:businessMeaning>strin70g</rq:businessMeaning>
                        <rq:qualityAndLiquidityEstimation>string71</rq:qualityAndLiquidityEstimation>
                        <rq:currency>strin72</rq:currency>
                        <rq:estimatedValueType>string73</rq:estimatedValueType>
                        <rq:guarantorRating>string74</rq:guarantorRating>
                    </rq:collateral>
                    <rq:losses>
                        <rq:percentLGD>1.051775E7</rq:percentLGD>
                        <rq:countEAD>1.051776E7</rq:countEAD>
                        <rq:currency>string</rq:currency>
                        <rq:reportDateAmount>1.051777E7</rq:reportDateAmount>
                        <rq:lossELpercent>1.051778E7</rq:lossELpercent>
                        <rq:lossELcount>1.051779E7</rq:lossELcount>
                        <rq:typeLGD>strin80g</rq:typeLGD>
                        <rq:statusLGD>string81</rq:statusLGD>
                        <rq:dateLGDcalculated>2019-08-19</rq:dateLGDcalculated>
                        <rq:finalizationDate>2018-02-04+04:00</rq:finalizationDate>
                        <rq:comment>string82</rq:comment>
                    </rq:losses>
                </rq:products>
                <rq:project>
                    <rq:projectName>string83</rq:projectName>
                    <rq:indicatorsOfConstruction>string84</rq:indicatorsOfConstruction>
                    <rq:parcel>string85</rq:parcel>
                    <rq:documentsPresence>string86</rq:documentsPresence>
                    <rq:equityVolume>string87</rq:equityVolume>
                    <rq:repaymentSpring>string88</rq:repaymentSpring>
                    <rq:projectVariant>string89</rq:projectVariant>
                    <rq:sameIndustryAsBorrower>true</rq:sameIndustryAsBorrower>
                    <rq:collateralProvided>false</rq:collateralProvided>
                    <rq:projectRating>
                        <rq:ratingID>string90</rq:ratingID>
                        <rq:ratingValue>1.051791E7</rq:ratingValue>
                        <rq:ratingType>string92</rq:ratingType>
                        <rq:ratingModel>string93</rq:ratingModel>
                        <rq:ratingCalculatedDate>2014-06-10+04:00</rq:ratingCalculatedDate>
                        <rq:ratingCalculatedRole>string94</rq:ratingCalculatedRole>
                        <rq:ratingCalculatedBy>string95</rq:ratingCalculatedBy>
                        <rq:ratingApprovalDate>2003-11-10+03:00</rq:ratingApprovalDate>
                        <rq:ratingApprovedBy>string96</rq:ratingApprovedBy>
                    </rq:projectRating>
                </rq:project>
                <rq:baseCurrency>s97</rq:baseCurrency>
                <rq:exchangeRates>
                    <rq:currencyName>string98</rq:currencyName>
                    <rq:currencyValue>1.051799E7</rq:currencyValue>
                    <rq:currencyDate>2000-09-25</rq:currencyDate>
                </rq:exchangeRates>
            </rq:deal>
        </crm:updateDealRq>
    </soap-env:Body>
</soap-env:Envelope>
